#####
#
# This section is for core cli
#
#####

tap "homebrew/core"

# macOS Appstore cli
brew "mas"

#####
#
# This is git-related brew
#
#####

# update system git
brew "git"
# add git-lfs support
brew "git-lfs"
# add git-flow support
brew "git-flow-avh"

# install subversion
brew "svn"

# install mercurial hg
brew "hg"

# terminal multiplexer
brew "tmux"

# ffmpeg for video processing
brew "ffmpeg"

# openssl for dotnet core
brew "openssl"

# archey for awesome intro scene
brew "archey"

# screenfetch is archey alternative
brew "screenfetch"

# update system perl
brew "perl"

# diff with color
brew "colordiff"

# update system curl
brew "curl"

# duti used for extension assignment
brew "duti"

# use for gpg signing
brew "gnupg"

# install lua
brew "lua"

# install latest go-lang
brew "go"

# update system grep
brew "grep"

# install python2
brew "python"

# install python3
brew "python3"

# httpie for awesome curl alternative
brew "httpie"

# hugo for static site gen
brew "hugo"

# using jenkins for CI
brew "jenkins"

# use kotlin as java alternative
brew "kotlin"

# nmap for scan open port
brew "nmap"

# using octave for math calculation
brew "octave"

# update system openssh
brew "openssh"

# install r for stats
brew "r"

# update system ruby
brew "ruby"

# to test internet speed
brew "speedtest-cli"

# to copy ssh public key
brew "ssh-copy-id"

# for tomcat server
brew "tomcat@6"

# to delete file to trash
brew "trash"

# display directory in tree view
brew "tree"

# wget for file downloading
brew "wget"

# Download youtube video
brew "youtube-dl"

# bfg to clean git sensitive files
brew "bfg"

# for syncing file
brew "rsync"

# screen cmd 
brew "screen"

# DNSCrypt to bypass your ISP DNS filtering
brew "dnscrypt-proxy"

# php
brew "php@7.1"

#####
#
# This section is for cask
#
#####

tap "caskroom/cask"
tap "caskroom/versions"

# Use iTerm2 as main terminal
cask "iterm2"

#####
# 
# Web browsers
#
#####

# firefox for security
cask "firefox"
# google chrome for development
cask "google-chrome"
# battery-friendly browser with latest feature
cask "safari-technology-preview"

#####
#
# Text editors
#
#####

# VSCode, the core IDE
cask "visual-studio-code"
# Brackets for CSS-ing
cask "brackets"
# Macvim for native and terminal usage
cask "macvim"
# Another lightweight text editor
cask "textmate"
# Android Studio
cask "android-studio"

# manage iOS certificate with fastlane
cask "fastlane"

# manage /etc/hosts with Gas Mask
cask "gas-mask"

# to access SFTP/FTP/etc
cask "cyberduck"

# Simple TeX cli tool
cask "basictex"

# Lightweight REST Client
cask "cocoarestclient"

# to see your battery life
cask "coconutbattery"

# disk inventory x alternative
cask "grandperspective"

# for Image editing
cask "gimp"

# optimize image size without losing quality
cask "imageoptim"

# To extract/compress files
cask "keka"

# I prefer libreoffice for office stuff
cask "libreoffice"

# Watch favorite movies with VLC
cask "vlc"

# video transcoding
cask "handbrake"

# appcleaner
cask "appcleaner"

# inkscape for vector design
cask "inkscape"

# sourcetree
cask "sourcetree"

# svn desktop client
cask "svnx"

# spotify to stream music
cask "spotify"

# Listen Spotify without ad
cask "spotifree"

# skype for chatting
cask "skype"

# docker for app dev
cask "docker"

# best mysql client
# cask "mysqlworkbench"
cask "sequel-pro"

# HockeyApp
cask "hockey"

# Google Drive
cask "google-backup-and-sync"

# for managing cryptography keys
cask "keybase"

# for work time tracker
cask "hubstaff"

# for upwork
cask "upwork"

# for rasberry pi installation
cask "etcher"

# signal chat
cask "signal"

# for virtualizing linux
cask "virtualbox"

# for file editing
cask "bbedit"

# for database browsing
cask "dbeaver-community"

#####
#
# FUSE
#
#####

# Support FUSE for macOS
cask "osxfuse"

# mount ssh to Finder
brew "sshfs"

# for golang delve
tap "go-delve/delve"

brew "go-delve/delve/delve"

tap "homebrew/bundle"

#####
#
# Apps from macOS App Store
#
#####

# to make your mac machine always on
mas "Caffeine", id: 411246225

# to annonate image quickly
mas "Skitch", id: 425955336

