##
# This section is for core cli
tap "homebrew/core"

# macOS Appstore cli
brew "mas"

##
# This is git-related brew
# update system git
brew "git"
# add git-lfs support
brew "git-lfs"
# add git-flow support
brew "git-flow-avh"

# terminal multiplexer
brew "tmux"

# ffmpeg for video processing
brew "ffmpeg"

# openssl for dotnet core
brew "openssl"

# archey for awesome intro scene
brew "archey"

# update system perl
brew "perl"

# diff with color
brew "colordiff"

# update system curl
brew "curl"

# duti used for extension assignment
brew "duti"

# use for gpg signing
brew "gnupg"

# install lua
brew "lua"

# install latest go-lang
brew "go"

# update system grep
brew "grep"

# install python2
brew "python"

# install python3
brew "python3"

# httpie for awesome curl alternative
brew "httpie"

# hugo for static site gen
brew "hugo"

# using jenkins for CI
brew "jenkins"

# use kotlin as java alternative
brew "kotlin"

# nmap for scan open port
brew "nmap"

# using octave for math calculation
brew "octave"

# update system openssh
brew "openssh"

# install r for stats
brew "r"

# update system ruby
brew "ruby"

# to test internet speed
brew "speedtest-cli"

# to copy ssh public key
brew "ssh-copy-id"

# for tomcat server
brew "tomcat@6"

# to delete file to trash
brew "trash"

# display directory in tree view
brew "tree"

# wget for file downloading
brew "wget"

##
# Tap PHP
tap "homebrew/homebrew-php"

brew "php71"
brew "php71-xdebug"

##
# This section is for cask
tap "caskroom/cask"

# Use iTerm2 as main terminal
cask "iterm2"

##
# install browsers
# Opera for entertainment (and VPN)
cask "opera"
# firefox for security
cask "firefox"
# google chrome for development
cask "google-chrome"

##
# install text editors
# VSCode, the core IDE
cask "visual-studio-code"
# Brackets for CSS-ing
cask "brackets"
# Macvim for native and terminal usage
cask "macvim"
# Sublime Text is lighweight alternative
cask "sublime-text"
# Another lightwright text editor
cask "textmate"
# Android Studio
cask "android-studio"

# manage iOS certificate with fastlane
cask "fastlane"

# manage /etc/hosts with Gas Mask
cask "gas-mask"

# DNSCrypt to bypass your ISP DNS filtering
cask "dnscrypt"

# to access SFTP/FTP/etc
cask "cyberduck"
# encrypt every files
cask "cryptomator"

# Simple TeX cli tool
cask "basictex"

# Lightweight REST Client
cask "cocoarestclient"

# cleanup caches and clutter in macOS
cask "ccleaner"

# to see your battery life
cask "coconutbattery"

# to see everything in your disk
cask "disk-inventory-x"

# for Image editing
cask "gimp"

# optimize image size without losing quality
cask "imageoptim"

# To extract/compress files
cask "keka"

# I prefer libreoffice for office stuff
cask "libreoffice"

# Watch favorite movies with VLC
cask "vlc"

# video transcoding
cask "handbrake"

# appcleaner
cask "appcleaner"

# inkscape for vector design
cask "inkscape"

# sourcetree
cask "sourcetree"

# spotify to stream music
cask "spotify"

# Listen Spotify without ad
cask "spotifree"

# skype for chatting
cask "skype"

# best mysql client
cask "mysqlworkbench"

# for golang delve
tap "go-delve/delve"

brew "go-delve/delve/delve"

tap "homebrew/bundle"

##
# macOS App Store

# to make your mac machine always on
mas "Caffeine", id: 411246225

# to annonate image quickly
mas "Skitch", id: 425955336

